app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
    def index
        @schools = SchoolClass.all

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @school = SchoolClass.find(params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science "], ["room_number", 202], ["created_at", "2020-12-16 00:38:17.331427"], ["updated_at", "2020-12-16 00:38:17.331427"]]
---
    def create
        @school = SchoolClass.new
        @school.title = params[:school_class][:title]
        @school.room_number = params[:school_class][:room_number]
        @school.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @school = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "testing-psych"], ["room_number", 123], ["updated_at", "2020-12-16 01:27:41.646335"], ["id", 5]]
---
    def update
        @school = SchoolClass.find(params[:id])

        @school.update(school_params(:title, :room_number))