app/controllers/students_controller.rb

    def create
        @student= Student.create!(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "aa-ron"], ["last_name", "jenkins"], ["created_at", "2020-12-16 05:46:50.227706"], ["updated_at", "2020-12-16 05:46:50.227706"]]

    def update
        @student = Student.find(params[:id])
        @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "jordan"], ["updated_at", "2020-12-16 05:47:00.522939"], ["id", 3]]